silkmonger/Esp32_UDP_node/sketch/push_notifications.cpp
#include "esp32-hal-gpio.h"
#include "stdint.h"
/*
 filename: push_notifications.cpp

 description: namespace and methods for HTTP client interface, with 'pushover' push notifications

    using WiFiClientSecure, but no digital certificate

    potentially promising video: https://youtu.be/32VcKyI0dio
    per this (and some other) videos, the way to work is a step by step 'client.print()' or 'client.println()' calls
    sending the HTTP request bit by bit.
    there seems to be a debate wheter connect() should be done to port 80 or port 443

  good video on ArduinoJson: https://youtu.be/NYP_CxdYzLo

 */

#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ArduinoJson.h>

#include "shared_vars.h"
extern char string_var[][STRING_VARS_SIZE];
// char push_notification_buffer[PUSH_NOTIFICATION_STRING_SIZE];

void debug_error(String);
void debug_ok(String);

// external function prototypes
void led_on(bool turn_it_on);
void led_off(void);

namespace my_PN
{
  // String http_post_data = "{'token': 'xxxxxxxxxxxx', 'user': 'ssssssssssssss', 'message': '123'}";
  String http_post_data = "";
  WiFiClientSecure client;

  const uint8_t API_TOKEN_SIZE = 32;
  const uint8_t API_USER_SIZE = 32;
  const uint8_t PUSH_NOTIFICATION_STRING_SIZE=16;

  const char * server = "https://api.pushover.net/1/messages.json";
  const char * test_server = "www.howsmyssl.com";
  const char * weather_server = "api.openweathermap.org";

  char pushover_api_token[API_TOKEN_SIZE];
  char pushover_api_user[API_USER_SIZE];
  bool pushover_api_cerdentials_ready = false;
  char push_notification_buffer[PUSH_NOTIFICATION_STRING_SIZE];
  char gpio_notification_buffer[PUSH_NOTIFICATION_STRING_SIZE];

  // const char * dummy_api_json_response = "{'coord': {'lon': 34.8265, 'lat': 32.1701}, 'weather': [{'id': 801, 'main': 'Clouds', 'description': 'few clouds', 'icon': '02d'}], 'base': 'stations', 'main': {'temp': 295.23, 'feels_like': 294.28, 'temp_min': 294.46, 'temp_max': 295.23, 'pressure': 1013, 'humidity': 30}, 'visibility': 10000, 'wind': {'speed': 3.09, 'deg': 190}, 'clouds': {'all': 20}, 'dt': 1678968166, 'sys': {'type': 1, 'id': 6845, 'country': 'IL', 'sunrise': 1678938623, 'sunset': 1678981720}, 'timezone': 7200, 'id': 294778, 'name': 'Herzliya', 'cod': 200}";
  char api_response[] = "{\"coord\": {\"lon\": 34.8265, \"lat\": 32.1701}, \"weather\": [{\"id\": 801, \"main\": \"Clouds\", \"description\": \"few clouds\", \"icon\": \"02d\"}], \"base\": \"stations\", \"main\": {\"temp\": 295.23, \"feels_like\": 294.28, \"temp_min\": 294.46, \"temp_max\": 295.23, \"pressure\": 1013, \"humidity\": 30}, \"visibility\": 10000, \"wind\": {\"speed\": 3.09, \"deg\": 190}, \"clouds\": {\"all\": 20}, \"dt\": 1678968166, \"sys\": {\"type\": 1, \"id\": 6845, \"country\": \"IL\", \"sunrise\": 1678938623, \"sunset\": 1678981720}, \"timezone\": 7200, \"id\": 294778, \"name\": \"Herzliya\", \"cod\": 200}";
  char json_x[] = "{\"sensor\":\"gps\",\"time\":1351824120,\"data\":[48.756080,2.302038]}";
  StaticJsonDocument<200> json_doc;

  const uint16_t HTTP_RESPONSE_BUFFER_SIZE = 1024;
  char http_response_buffer[HTTP_RESPONSE_BUFFER_SIZE];

  typedef enum
  {
    udp_command,
    gpio_event,
    reserved_0,
    reserved_1
  } set_text_target_id_t;

  // push notification on GPIO value change (added 2023/04/12)
  bool           push_on_gpio_enabled;
  uint8_t        push_on_gpio_pin_number;
  bool           push_on_gpio_true_rising_false_falling;
  int            push_on_gpio_previous_read_value;
  uint16_t       push_on_gpio_backoff_seconds;
  const uint16_t push_on_gpio_minimum_backoff = 30;
  unsigned long  push_on_gpio_next_push_millis;
  unsigned long  push_on_gpio_backoff_window_millis;
  bool           push_on_gpio_backoff_wraparound_flag;                 // millis() wrap-around logic
  // added 2023-04-13
  uint16_t       push_on_gpio_suppressed_events;
  unsigned long  push_on_gpio_last_edge_detect_millis;
  bool           push_on_gpio_backoff_flag;
  uint32_t       push_on_gpio_debounce_millis;

  //
  // GPIO events log
  //
  const uint8_t  GPEL_SIZE=15;
  uint32_t       gpel_event_list[GPEL_SIZE];
  uint8_t        gpel_write_ptr;
  uint8_t        gpel_read_ptr;
  uint16_t       gpel_overrun_count;

  // private function prototypes
  void gpio_event_handler(unsigned long);
  uint8_t gpio_event_log_event_count(void);
  void purge_gpio_event_log(void);
  uint32_t read_from_gpio_event_log(void);

  void post_request(void)
  {
    client.setInsecure();
    if (!client.connect(server, 443))
    {
      Serial.println("Connection failed!");
    }
    else {
      Serial.println("Connected to server!");
    }
    client.stop();
  } // void post_request(void)

  uint32_t get_request_test(void)
  {
    client.setInsecure();
    uint32_t rv = 0xDEADBEEF;
    if (!client.connect(test_server, 443))
      Serial.println("Connection failed!");
    else
    {
      Serial.println("Connected to server!");
      // Make a HTTP request:
      client.println("GET https://www.howsmyssl.com/a/check HTTP/1.0");
      client.println("Host: www.howsmyssl.com");
      client.println("Connection: close");
      client.println();

      while (client.connected()) {
        String line = client.readStringUntil('\n');
        if (line == "\r") {
          Serial.println("headers received");
          break;
        }
      }
      // if there are incoming bytes available
      // from the server, read them and print them:
      uint32_t char_count = 0;
      while (client.available()) {
        char c = client.read();
        Serial.write(c);
        if((++char_count % 64) == 0)
          Serial.println("    ");
      }

      client.stop();
      Serial.println();
      Serial.println(String(char_count) + " characters received as payload\n");
      rv = char_count;
    } // successful connection
    return rv;
  } // void get_request_test(void)

