silkmonger/Esp32_UDP_node/sketch/push_notifications.cpp
  void print_gpio_event_list(void)
  {
    uint32_t event_millis;
    Serial.println("gpio_event_log_event_count() = " + String(gpio_event_log_event_count()) + "/" + String(GPEL_SIZE));
    while(gpio_event_log_event_count() != 0)
    {
      event_millis = read_from_gpio_event_log();
      Serial.println("  " + String(gpio_event_log_event_count()) + " "+ String(event_millis) + " milliseconds");
    }
    Serial.println("gpel_overrun_count = " + String(gpel_overrun_count));
  } // void print_gpio_event_list(void)

  uint32_t openweather_get_request(void)
  {
    client.setInsecure();
    uint32_t rv = 0xDEADBEEF;
    if (!client.connect(weather_server, 443))
      Serial.println("Connection failed!");
    else
    {
      String lon = "34.826509";
      String lat = "32.170149";
      String k1 = "b243a10a58a97f95080af796a429b718";
      String request_url = "http://api.openweathermap.org/data/2.5/weather?lat=" + String(lat) + "&lon=" + String(lon) + "&APPID=" + String(k1);
      Serial.println("Connected to server!");
      // Make a HTTP request:
      client.println("GET " + request_url + " HTTP/1.0");
      client.println("Host: " + String(weather_server));
      client.println("Connection: close");
      client.println();

      while (client.connected()) {
        String line = client.readStringUntil('\n');
        if (line == "\r") {
          Serial.println("headers received");
          break;
        }
      }
      // if there are incoming bytes available
      // from the server, read them and print them:
      uint32_t char_count = 0;
      bool buffer_overrun = false;
      while (client.available()) {
        char c = client.read();
        Serial.write(c);
        if(char_count < HTTP_RESPONSE_BUFFER_SIZE)
          http_response_buffer[char_count] = c;
        else
          buffer_overrun = true;
        if((++char_count % 64) == 0)
          Serial.println("    ");
      }
      client.stop();
      Serial.println();
      Serial.println(String(char_count) + " characters received as payload\n");

      // try parsing response
      if(buffer_overrun)
        Serial.println("[NOTOK] response buffer overrun");
      else
      {
        http_response_buffer[char_count] = NULL;
        DeserializationError error = deserializeJson(json_doc, http_response_buffer);
        if (error)
          Serial.println("[NOTOK] JSON parsing failed");
        else
        {
          // copy-paste from arduinojson assistant
          JsonObject main = json_doc["main"];
          float main_temp = main["temp"]; // 287.27
          float main_feels_like = main["feels_like"]; // 287.04
          float main_temp_min = main["temp_min"]; // 287.23
          float main_temp_max = main["temp_max"]; // 288.2
          int main_pressure = main["pressure"]; // 1011
          int main_humidity = main["humidity"]; // 88
          Serial.println("[OK] Temperature:" + String(main_temp) + ", feels like " + String(main_feels_like) + "\n\n");
        } // successful parsing
      } // response buffer intact

      rv = char_count;
    } // successful connection
    return rv;
  } // uint32_t openweather_get_request(void)

  uint32_t test_post_request(void)
  {
    char * post_test_server = "httpbin.org";
    client.setInsecure();
    uint32_t rv = 0xDEADBEEF;
    if (!client.connect(post_test_server, 443))
      Serial.println("Connection failed!");
    else
    {
      String request_url = "https://httpbin.org/post?x=123";
      Serial.println("Connected to server!");
      // Make a HTTP request:
      client.println("POST " + request_url + " HTTP/1.0");
      client.println("Host: " + String(post_test_server));
      client.println("Connection: close");
      client.println();

      while (client.connected()) {
        String line = client.readStringUntil('\n');
        if (line == "\r") {
          Serial.println("headers received");
          break;
        }
      }
      // if there are incoming bytes available
      // from the server, read them and print them:
      uint32_t char_count = 0;
      while (client.available()) {
        char c = client.read();
        if(char_count < HTTP_RESPONSE_BUFFER_SIZE)
          http_response_buffer[char_count] = c;
        Serial.write(c);
        if((++char_count % 64) == 0)
          Serial.println("    ");
      }
      http_response_buffer[char_count-1] = NULL;

      client.stop();
      Serial.println();
      Serial.println(String(char_count) + " characters received as payload (" + String(strlen(http_response_buffer)) + ")");
      DeserializationError error = deserializeJson(json_doc, http_response_buffer);
      if(error)
      {
        Serial.println("[NOTOK] JSON parsing failed");
      }
      else
      {
        const char * x_value = json_doc["args"]["x"];
        Serial.println("[OK] JSON parsing success, x=" + String(x_value));
      }
      Serial.println("\n");
      rv = char_count;
    } // successful connection
    return rv;
  } // uint32_t test_post_request()

  uint32_t push_notification(char* message_buffer)
  {
    if(!pushover_api_cerdentials_ready)
    {
      Serial.println("[NOTOK] pushover API credentials missing");
      return 0xDEADBEEF;
    }

    char * pushover_server = "api.pushover.net";
    client.setInsecure();
    uint32_t rv = 0xDEADBEEF;
    if (!client.connect(pushover_server, 443))
      Serial.println("Connection failed!");
    else
    {
      String message = strlen(message_buffer)==0 ? "!#?" : String(message_buffer);
      String request_url = "https://api.pushover.net/1/messages.json?token=" + String(pushover_api_token) + "&user=" 
                                                                             + String(pushover_api_user) + "&message=" + message;
      Serial.println("Connected to server! (text: " + message + ")");
      // Make a HTTP request:
      client.println("POST " + request_url + " HTTP/1.0");
      client.println("Host: " + String(pushover_server));
      client.println("Connection: close");
      client.println();

