silkmonger/Esp32_UDP_node/sketch/push_notifications.cpp
      while (client.connected()) {
        String line = client.readStringUntil('\n');
        if (line == "\r") {
          Serial.println("headers received");
          break;
        }
      }
      // if there are incoming bytes available
      // from the server, read them and print them:
      uint32_t char_count = 0;
      while (client.available()) {
        char c = client.read();
        if(char_count < HTTP_RESPONSE_BUFFER_SIZE)
          http_response_buffer[char_count] = c;
        Serial.write(c);
        if((++char_count % 64) == 0)
          Serial.println("    ");
      }
      http_response_buffer[char_count-1] = NULL;

      client.stop();
      Serial.println();
      Serial.println(String(char_count) + " characters received as payload (" + String(strlen(http_response_buffer)) + ")");
      DeserializationError error = deserializeJson(json_doc, http_response_buffer);
      if(error)
      {
        Serial.println("[NOTOK] JSON parsing failed");
      }
      else
      {
        Serial.println("[OK] JSON parsing success");
        int status = json_doc["status"];
        const char * request = json_doc["request"];
        Serial.println("     Server response: status=" + String(status) + ", request=" + String(request));
        strcpy(string_var[0], request);
      }
      Serial.println("\n");
      rv = char_count;
    } // successful connection
    return rv;
  } // uint32_t push_notification(char* message_buffer)

  void parse_json_test(void)
  {
    // using example at: https://arduinojson.org/v6/example/parser/
    Serial.println("starting 'parse_json_test()'");
    DeserializationError error = deserializeJson(json_doc, json_x);
    if(error) {
      Serial.println("[NOTOK] 'parse_json_test' failed");
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
    }
    else
    {
      Serial.println("[OK] 'parse_json_test' passed");
      const char* sensor = json_doc["sensor"];
      long time = json_doc["time"];
      double latitude = json_doc["data"][0];
      double longitude = json_doc["data"][1];
      char lon_buff[10];
      char lat_buff[10];

      // Print values.
      dtostrf(longitude, 4, 6, lon_buff); // simple String(longitude) won't do, it rounds to two decimal places
      dtostrf(latitude, 4, 6, lat_buff);  // simple String(latitude) won't do, it rounds to two decimal places
      String readout = "Sensor: " + String(sensor) + ", time: " + String(time) + ", GPS coordinates: (" + lat_buff + ", " + lon_buff + ")";
      Serial.println(readout);
      // Serial.println(sensor);
      // Serial.println(time);
      // Serial.println(latitude, 6);
      // Serial.println(longitude, 6);
    } // JSON parsing (deserialization) success
  } // void parse_json_test(void)

  uint32_t set_pushover_credentials(void)
  {
    /*-----------------------------------------------------------------------------------------------
     copy string variables 0 and 1 to API user and token buffers, respectively.
     then erase string variables 0 and 1
     this is needed so that we do not keep hard-coded credentials in the sketch
     -----------------------------------------------------------------------------------------------*/
     uint32_t rv = NOTOK_STATUS_32b; // error
     if((strlen(string_var[0]) < API_USER_SIZE) && (strlen(string_var[1]) < API_TOKEN_SIZE))
     {
       strcpy(pushover_api_user, string_var[0]);
       strcpy(pushover_api_token, string_var[1]);
       pushover_api_cerdentials_ready = true;
       for(int n=0; n<2; n++)
         strcpy(string_var[n], "----------------------------");
       
       Serial.println("pushover USER=" + String(pushover_api_user));
       Serial.println("pushover TOKEN=" + String(pushover_api_token));
       rv = OK_STATUS_32b;
     }
     else
     {
       Serial.println("[NOTOK] string variables are too long");
       pushover_api_cerdentials_ready = false;
       rv = NOTOK_STATUS_32b;
     }
     return rv;
  } // uint32_t set_pushover_credentials(void)

  uint16_t set_push_notification_text(uint8_t string_var_index, set_text_target_id_t target_id)
  {
    // return zero for error, or text length upon success
    if(string_var_index >= STRING_VARS_COUNT)
    {
      debug_error("string index " + String(string_var_index) + " out of bounds");
      return 0;
    }

    if(strlen(string_var[string_var_index]) >= PUSH_NOTIFICATION_STRING_SIZE)
    {
      debug_error("text too large (" + String(strlen(string_var[string_var_index])) + ") characters");
      return 0;
    }

    switch(target_id)
    {
      case udp_command:
        strcpy(push_notification_buffer, string_var[string_var_index]);
        debug_ok("push notification text set to '" + String(push_notification_buffer) + "'");
        break;

      case gpio_event:
        strcpy(gpio_notification_buffer, string_var[string_var_index]);
        break;

      default:
        debug_error("set_text_target_id_t: reserved value");
        break;
    }
    // strcpy(push_notification_buffer, string_var[string_var_index]);
    // debug_ok("push notification text set to '" + String(push_notification_buffer) + "'");
    return strlen(string_var[string_var_index]);
  } // uint16_t set_push_notification_text(uint8_t string_var_index, set_text_target_id_t target_id)

  void purge_gpio_event_log(void)
  {
    gpel_write_ptr = 0;
    gpel_read_ptr = 0;
    gpel_overrun_count = 0;
  } // void purge_gpio_event_log(void)

  void write_to_gpio_event_log(uint32_t _millis)
  {
    gpel_event_list[gpel_write_ptr++] = _millis;
    gpel_write_ptr %= GPEL_SIZE;
    if(gpel_write_ptr == gpel_read_ptr)
    {
      gpel_overrun_count++;
      gpel_read_ptr++;
      gpel_read_ptr %= GPEL_SIZE;
    }
  } // void write_to_gpio_event_log(uint_32t _millis)

  uint32_t read_from_gpio_event_log(void)
  {
    // !!! UNSAFE !!!
    // this function advanced read pointer unconditionally, which may cause list corruption.
    uint32_t read_value = gpel_event_list[gpel_read_ptr];
    if(gpel_read_ptr != gpel_write_ptr)
    {
      gpel_read_ptr++;
      gpel_read_ptr %= GPEL_SIZE;
    }
    return read_value;
  } // uint32_t read_from_gpio_event_log(void)

