silkmonger/Esp32_UDP_node/sketch/push_notifications.cpp
  uint8_t gpio_event_log_event_count(void)
  {
    if(gpel_write_ptr >= gpel_read_ptr)
      return gpel_write_ptr - gpel_read_ptr;
    else
      return GPEL_SIZE + gpel_write_ptr - gpel_read_ptr;
  } // uint8_t gpio_event_log_event_count(void)

  void initialize_push_on_gpio(void)
  {
    push_on_gpio_enabled = false;
    push_on_gpio_pin_number = 0;
    push_on_gpio_true_rising_false_falling = true;
    push_on_gpio_previous_read_value = LOW;
    push_on_gpio_backoff_seconds = 30;
    push_on_gpio_backoff_wraparound_flag = false;
    push_on_gpio_suppressed_events = 0;
    push_on_gpio_last_edge_detect_millis = 0;
    push_on_gpio_debounce_millis = 1000;                 // one second debounce interval
  } // void initialize_push_on_gpio(void)

  uint32_t enable_push_on_gpio(uint8_t pin_number, bool edge_polarity, uint16_t backoff_seconds, uint16_t debounce_seconds)
  {
    unsigned long _millis = millis();
    if(pin_number == 0)
    {
      Serial.println("enable_push_on_gpio: DISABLED");
      push_on_gpio_enabled = false;
      push_on_gpio_pin_number = 0;
      push_on_gpio_backoff_window_millis = 0;
      led_off();
    }
    else
    {
      push_on_gpio_enabled = true;
      push_on_gpio_pin_number = pin_number;
      push_on_gpio_true_rising_false_falling = edge_polarity;
      push_on_gpio_backoff_seconds = backoff_seconds;
      pinMode(pin_number, INPUT);
      push_on_gpio_previous_read_value = digitalRead(pin_number);
      push_on_gpio_next_push_millis = _millis;
      push_on_gpio_backoff_window_millis = 1000*MAX(push_on_gpio_backoff_seconds, push_on_gpio_minimum_backoff);
      push_on_gpio_debounce_millis = MAX(1000, MIN(1000*debounce_seconds, push_on_gpio_backoff_window_millis/8));
      Serial.println("enable_push_on_gpio: enabled, pin " + String(push_on_gpio_pin_number) + String(edge_polarity ? " rising" : " falling") + 
                     " edge, " + String(push_on_gpio_backoff_seconds) + " seconds backoff");
      Serial.println("                     push_on_gpio_debounce_millis = " + String(push_on_gpio_debounce_millis));
    }
    push_on_gpio_backoff_flag = false;
    push_on_gpio_backoff_wraparound_flag = false;
    return push_on_gpio_backoff_window_millis;
  } // uint32_t enable_push_on_gpio(uint8_t pin_number, bool edge_polarity, uint16_t backoff_seconds, uint16_t debounce_seconds)

  void update_push_on_gpio_next_push(unsigned long _millis)
  {
    // this method keeps 'xxxx' BEHIND _millis when _millis goes through wrap-around (each 50 days or so)
    // without this, we are at risk of being blocked from sending push notification (on GPIO) for many days.

    // logic here is as follows:
    // if millis, is smaller than the backoff window size, and the next push marker is HIGHER than the maximal possible
    // window size, than we know, for sure, that the wrap-around millis isn't within a backoff window, and we can safely
    // reset the next push marker to zero millis

    if((_millis < push_on_gpio_backoff_window_millis) && (push_on_gpio_next_push_millis > 0x10000*1000))
      push_on_gpio_next_push_millis = 0;   
  }

  void check_gpio(unsigned long _millis)
  {
    static char text[16];
    if(push_on_gpio_enabled)
    {
      int read_value = digitalRead(push_on_gpio_pin_number);
      bool rising = (read_value == HIGH) && (push_on_gpio_previous_read_value == LOW);
      bool falling = (read_value == LOW) && (push_on_gpio_previous_read_value == HIGH);
      if((rising && push_on_gpio_true_rising_false_falling) || (falling && !push_on_gpio_true_rising_false_falling))
      {
        gpio_event_handler(_millis);
      } // send rising/falling edge push notification
      else
      {
        update_push_on_gpio_next_push(_millis);
      }
      push_on_gpio_previous_read_value = read_value;
    }

    // clear wrap-around flag if required
    if(push_on_gpio_backoff_wraparound_flag && (_millis <= push_on_gpio_backoff_window_millis))
      push_on_gpio_backoff_wraparound_flag = false;

    if(push_on_gpio_backoff_flag && !push_on_gpio_backoff_wraparound_flag)
    {
      if(_millis >= push_on_gpio_next_push_millis)
      {
        push_on_gpio_backoff_flag = false;
        Serial.println("push_on_gpio: backoff period (" + String(push_on_gpio_backoff_window_millis) + " milliseconds) ended");
        Serial.println("push_on_gpio: " + String(push_on_gpio_suppressed_events) + " events suppressed");
        led_off();
        print_gpio_event_list();
        // send end of backoff push notification
        if((strlen(gpio_notification_buffer) > 0) && (push_on_gpio_backoff_window_millis > 899)) // if test message configured, and backoff window is gte 15 minutes
        {
          if(push_on_gpio_suppressed_events == 0)
            push_notification("backoff done");
          else
          {
            snprintf(text, 16, "%i suppressed", push_on_gpio_suppressed_events);
            push_notification(text);
          }
        }
        purge_gpio_event_log();
      }
    } // backoff end logic
  } // void check_gpio(unsigned long _millis)

  void gpio_event_handler(unsigned long _millis)
  {
    // suppress notification during backoff window.
    // how do we protect agains wraparound error?
    // 
    // if((_millis > push_on_gpio_next_push_millis) && !push_on_gpio_backoff_wraparound_flag)
    bool blcoked_by_debouncer = false;
    if(!push_on_gpio_backoff_flag)
    {
      // we are out of the backoff window, HTTP API request should be issued
      Serial.println("GPIO edge push notification " + String(_millis - push_on_gpio_next_push_millis));
      unsigned long next_next = _millis + push_on_gpio_backoff_window_millis;
      // if(next_next < push_on_gpio_backoff_window_millis)
      if(next_next < _millis)
        push_on_gpio_backoff_wraparound_flag = true;
      push_on_gpio_next_push_millis = next_next;
      push_on_gpio_suppressed_events = 0;
      push_on_gpio_backoff_flag = true;
      if(strlen(gpio_notification_buffer) > 0)
        push_notification(gpio_notification_buffer);
      else
        Serial.println("[NOTOK] no push notification: GPIO notification is NULL");
      led_on(true);
      write_to_gpio_event_log(_millis);
    }
    else
    {
      // we are still within the backoff window: apply debunce and notification suppression logic.
      // - debounce: any adjascent events less than one second apart from each other, are considered mechanical jitter, and therefore
      //             ignored.
      // - suppression: any event passing the debounce logic within the backoff window is simply registered by means of suppressed
      //                events counter. push notification, however, is not being sent out.

      Serial.println("GPIO edge ignored (backoff ends in " + String(push_on_gpio_next_push_millis-_millis) + " milliseconds)");
      if(_millis > push_on_gpio_last_edge_detect_millis + push_on_gpio_debounce_millis)
      {
        push_on_gpio_suppressed_events++;
        write_to_gpio_event_log(_millis);
        Serial.println("GPIO Event: suppressed (" + String(push_on_gpio_suppressed_events) + ") so far");
      }
      else
      {
        Serial.println("GPIO Event: filtered out by debounce logic (" + String(push_on_gpio_debounce_millis) + ") millis");
        blcoked_by_debouncer = true;
      }            
    }
    if(!blcoked_by_debouncer)
      push_on_gpio_last_edge_detect_millis = _millis;
  } // void gpio_event_handler(unsigned long _millis)

  void erase_credentials(void)
  {
    pushover_api_cerdentials_ready = false;
    strcpy(pushover_api_token, "");
    strcpy(pushover_api_user, "");
    strcpy(push_notification_buffer, "");
    strcpy(gpio_notification_buffer, "");
    initialize_push_on_gpio();
    purge_gpio_event_log();
  } // void erase_credentials(void)

  uint8_t read_numbers_list_1(uint8_t* write_ptr)
  {
    // for(uint8_t n=0; n<4; n++)
    // {
    //   *write_ptr = 100+n;
    //   write_ptr++;
    // }
    uint8_t offset = 0;
    *(write_ptr + (offset++)) = push_on_gpio_pin_number;
    // offset 1:  backoff window size (seconds)
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_seconds >> 0) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_seconds >> 8) & 0xff;
    // offset 3: debounce interval
    *(write_ptr + (offset++)) = (push_on_gpio_debounce_millis >>  0) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_debounce_millis >>  8) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_debounce_millis >> 16) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_debounce_millis >> 24) & 0xff;
    // offset 7:  backoff window size (milliseconds)    
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_window_millis >> 0) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_window_millis >> 8) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_window_millis >> 16) & 0xff;
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_window_millis >> 24) & 0xff;
    // offset 11: suppressed GPIO events count
    *(write_ptr + (offset++)) = (push_on_gpio_suppressed_events >> 0) & 0xff; 
    *(write_ptr + (offset++)) = (push_on_gpio_suppressed_events >> 8) & 0xff; 
    // offset 13: a few GPIO event related boolean flags
    *(write_ptr + (offset++)) = (push_on_gpio_backoff_flag              ? 0x01 : 0)
                              | (push_on_gpio_enabled                   ? 0x02 : 0)
                              | (push_on_gpio_true_rising_false_falling ? 0x04 : 0)
                              | (pushover_api_cerdentials_ready         ? 0x08 : 0);

    Serial.println("read_numbers_list_1() generates " + String(offset) + " octets payload");
    return offset;
  } // uint8_t read_numbers_list_1(uint8_t* write_ptr)

} // namespace my_PN

uint32_t pn_get_request_test(void){ return my_PN::get_request_test(); }
uint32_t pn_openweather_get_request(void){ return my_PN::openweather_get_request(); }
void pn_parse_json_test(void){ my_PN::parse_json_test(); }
uint32_t pn_test_post_request(void){ return my_PN::test_post_request(); }
uint32_t pn_push_notification(void){ return my_PN::push_notification(my_PN::push_notification_buffer); }
uint32_t pn_set_pushover_credentials(void){ return my_PN::set_pushover_credentials(); }
uint16_t pn_set_push_notification_text(uint8_t string_var_index){ return my_PN::set_push_notification_text(string_var_index, my_PN::udp_command); }
uint16_t pn_set_gpio_notification_text(uint8_t string_var_index){ return my_PN::set_push_notification_text(string_var_index, my_PN::gpio_event); }

void pn_erase_credentials(void){ my_PN::erase_credentials(); }

void pn_check_gpio(unsigned long _millis){ my_PN::check_gpio(_millis); }
uint32_t pn_gpio_enable(uint8_t pin_number, bool edge_polarity, uint16_t backoff_seconds, uint16_t debounce_seconds)
{ 
  return my_PN::enable_push_on_gpio(pin_number, edge_polarity, backoff_seconds, debounce_seconds); 
}

uint8_t pn_read_numbers_list_1(uint8_t* write_ptr){ return my_PN::read_numbers_list_1(write_ptr); }
